app/controllers/food_controller.rb

SELECT "foods".* FROM "foods" WHERE (name LIKE '%%')
---
	def index
		@foods = Food.search(params[:query])

SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT 1  [["id", "19"]]
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."name" = 'leche semidescremada de vaca' LIMIT 1
---
	def show
		@food = Food.find(params[:id])
		@ingredients = []
		@food.ingredients.split(',').each do |name|

SELECT "foods".* FROM "foods" WHERE "foods"."pending" = 't'
---
	def pending
		authorize! :pending, @user, :message => "Not authorized as an administrator."
		@foods = Food.find_all_by_pending(true)

SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT 1  [["id", "1"]]
---
	def edit
		if user_signed_in?
			if current_user.has_role? :registered or current_user.has_role? :banned
				redirect_to food_path(Food.find(params[:id]))

SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "foods" SET "econ_advice" = 'Advice!', "econ_score" = '1', "gastro_score" = '1', "updated_at" = '2012-12-02 02:27:37.215789' WHERE "foods"."id" = 1
---
	def update
		@food = Food.find(params[:id])
		@food.update_attributes!(params[:food])

SELECT "foods".* FROM "foods" WHERE "foods"."id" = ? LIMIT 1  [["id", "29"]]
DELETE FROM "foods" WHERE "foods"."id" = ?  [["id", 29]]
---
	def destroy
		@food = Food.find(params[:id])
		@food.destroy